# CreateRightStaticText

## Description
Similar to CreateStaticText, but creates static text that is right-justified in its control field on the dialog.

```pascal
PROCEDURE CreateRightStaticText(
				dialogID          : LONGINT;
				itemID            : LONGINT;
				text              : STRING;
				widthInCharacters : INTEGER);
```

```python
def vs.CreateRightStaticText(dialogID, itemID, text, widthInCharacters):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|itemID|LONGINT|   |
|text|STRING|   |
|widthInCharacters|INTEGER|   |

## Version
Availability: from VectorWorks12.0.1

## Category
* Dialogs - Modern